app/views/carts/_cart.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 3], ["id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
<%= link_to "#{current_order.order_items.size } items with a value of#{current_order.subtotal }$",carts_path%>