app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
INSERT INTO "order_items" ("quantity", "product_id", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["quantity", 1], ["product_id", 1], ["order_id", 1], ["created_at", "2020-09-01 06:34:38.623371"], ["updated_at", "2020-09-01 06:34:38.623371"]]
INSERT INTO "orders" ("subtotal", "created_at", "updated_at") VALUES (?, ?, ?)  [["subtotal", 12.0], ["created_at", "2020-09-01 06:34:38.621906"], ["updated_at", "2020-09-01 06:34:38.621906"]]
---
    def create
        @order = current_order
        @order_item = @order.order_items.new(order_params)
        @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 3], ["id", 4], ["LIMIT", 1]]
UPDATE "orders" SET "subtotal" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["subtotal", 51.0], ["updated_at", "2020-09-01 06:43:16.793070"], ["id", 3]]
UPDATE "order_items" SET "quantity" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["quantity", 2], ["updated_at", "2020-09-01 06:43:31.706836"], ["id", 4]]
---
    def update
        @order = current_order
        @order_item = @order.order_items.find(params[:id])
        @order_item.update_attributes(order_params)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 3], ["id", 3], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 3]]
---
    def destroy
        @order = current_order
        @order_item = @order.order_items.find(params[:id])
        @order_item.destroy