app/controllers/products_controller.rb

  def index
    @search = Product.search do
      fulltext params[:search]
    end
    @products = current_user.products.all
---
SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."user_id" = ?  [["user_id", 1]]

  def create
    @product = current_user.products.build(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("product_name", "product_price", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_file_name", "bec-brown-7RIm0GqvvkM-unsplash.jpg"], ["image_file_size", 911176], ["image_updated_at", "2020-08-28 08:46:38.364470"], ["updated_at", "2020-08-28 08:46:39.626513"], ["id", 5]]