app/controllers/purchases_controller.rb

  def index

    @order_items = current_order.order_items
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 5]]

  def create
    @purchase = Purchase.new(purchase_params)

    respond_to do |format|
      if @purchase.save
---
INSERT INTO "purchases" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-09-01 10:00:09.515290"], ["updated_at", "2020-09-01 10:00:09.515290"]]

    def set_purchase
      @purchase = Purchase.find(params[:id])
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]