app/controllers/shops_controller.rb

SELECT "products".* FROM "products"
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]
---
  def index
 #   @search = Product.search do
  #    fulltext params[:search]
   # end
    @products = Product.all
    @order_item = current_order.order_items.new